#Для списка реализовать обмен значений соседних элементов. Значениями обмениваются элементы с индексами
#0 и 1, 2 и 3 и т.д. При нечетном количестве элементов последний сохранить на своем месте. Для заполнения
#списка элементов нужно использовать функцию input()

list = []

count = input('Введите количество элементов списка: ')

while True:
    try:
        count = int(count)
        if count<=0:
            count = input('Количество элементов списка не может быть <= 0. Введите положительное целое число: ')
        else: break
    except ValueError:
        count = input('Введите положительное, целое число, а не строку или число с плавающей запятой: ')
        continue



for i in range(count):
    list.append(input(f'Введите {i+1}-й элемент списка '))

print(f"Исходный список: \n {list}")

i=0

while i < count-1:
    list[i],list[i+1] = list[i+1],list[i]
    i+=2
print(f'Список с перестановками элементов:\n{list}')








