#Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить, к какому времени года
#относится месяц (зима, весна, лето, осень). Напишите решения через list и dict

month_list = ['январь','февраль','март','апрель','май','июнь','июль','август','сентябрь','октябрь','ноябрь','декабрь' ]
seasons_list = ['зима','весна','лето','осень']
seasons_dict = {
    0: 'зима',
    1: 'весна',
    2: 'лето',
    3: 'осень'
}
month = input('Введите номер месяца: ')

while True:
    try:
        month = int(month)
        if (month<=0)|(month>12):
            month = input('Номер месяца должен быть целым положительным числом от 1 до 12. Повторим: ')
        else: break
    except ValueError:
        month = input('Введите целое число от 1 до 12: ')
        continue


if (month == 1) | (month == 2) | (month == 12):
    print(f'\033[31m С помощью списка: \n'
          f'\033[0m Текущее время года: зима, месяц: {month_list[month-1]} \n'
          f'\033[31m С помощью словаря: \n'
          f'\033[0m Текущее время года: {seasons_dict.get(0)}, месяц: {month_list[month-1]}')
elif (month >= 3) & (month <= 5):
    print(f'\033[31m С помощью списка: \n'
          f'\033[0m Текущее время года: весна, месяц: {month_list[month-1]} \n'
          f'\033[31m С помощью словаря: \n'
          f'\033[0m Текущее время года: {seasons_dict.get(1)}, месяц: {month_list[month-1]}')
elif (month >= 6) & (month <= 8):
    print(f'\033[31m С помощью списка: \n'
          f'\033[0m Текущее время года: лето, месяц: {month_list[month-1]} \n'
          f'\033[31m С помощью словаря: \n'
          f'\033[0m Текущее время года: {seasons_dict.get(2)}, месяц: {month_list[month-1]}')
else:
    print(f'\033[31m С помощью списка: \n'
          f'\033[0m Текущее время года: осень, месяц: {month_list[month-1]} \n'
          f'\033[31m С помощью словаря: \n'
          f'\033[0m Текущее время года: {seasons_dict.get(3)}, месяц: {month_list[month-1]}')


