#Реализовать структуру рейтинг, представляющую собой набор натуральных чисел, который не возрастает.
#У пользователя нужно запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы
#с одинаковыми значениями, то новый элемент должен разместиться после них
#Например набор натуральных чисел 7,5,3,3,2
#Пользователь ввел 3 -> 7,5,3,3,!3!,2
#Пользователь ввел 8 -> 8,7,5,3,3,!3!,2
#Пользователь ввел 1 -> 8,7,5,3,3,!3!,2,1
#Первоначальный набор натуральных чисел можно задать в коде, например my_list=[7,5,3,3,2]

my_list=[7,5,3,3,2,2]
print(f'первоначальный рейтинг:\n{my_list}')
a=input('Новое число: ')
while True:
    try:
        a = int(a)
        if a<0:
            a = input('Элемент рейтинга не может быть < 0. Введите положительное целое число: ')
        else: break
    except ValueError:
        a = input('Введите положительное, целое число, а не строку или число с плавающей запятой: ')
        continue
i=0
my_list.append(a)
while i<len(my_list):
    if int(my_list[i])<my_list[len(my_list)-1]:
        my_list.insert(i,my_list[len(my_list)-1])
        my_list.pop(len(my_list)-1)
        break
    elif int(my_list[i])==a:
        i+=1
        continue
    i+=1
print(f'рейтинг с учетом нового числа\n{my_list}')






