# *Реализовать структуру данных "Товары". Она должна представлять собой список кортежей. Каждый кортеж хранит информацию
# об отдельном товаре. В кортеже должно быть два элемента  —  номер товара и словарь с параметрами, то есть характеристиками
# товара: название, цена, количество, единица измерения.Структуру нужно сформировать программно, запросив все данные у
# пользователя. Пример готовой структуры:
# [
#     (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
#     (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
#     (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
# ]
# Нужно собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара, например, название.Тогда
# значение  —  список значений-характеристик, например, список названий товаров.
#
# Пример:
# {
# “название”: [“компьютер”, “принтер”, “сканер”],
# “цена”: [20000, 6000, 2000],
# “количество”: [5, 2, 7],
# “ед”: [“шт.”]
# }

i=input('Введите количество наименований товаров:\n')

while True:
    try:
        i = int(i)
        if i<0:
            i = input('Количество наименований товаров не может быть < 0. Введите положительное целое число: ')
        else: break
    except ValueError:
        i = input('Введите положительное, целое число, а не строку или число с плавающей запятой: ')
        continue

list=[]

#ввод товаров с терминала, после ввода значений предопределнных характеристик предлагается ввести новые
#характеристики и их значения

for i in range (i):
    current_dict = {'название':input('Введите название товара\n'),'цена':input('Введите цену\n'),'количество':input('Введите количество\n'),'ед':input('Введите единицы измерения\n')}
    a = input('Хотите ввести дополнительные характеристики товара и их значения? да/нет?\n')
    if a == 'да':
        while a == 'да':
            current_dict.update({input('Введите наименование характеристики\n'):input('Введите значение\n')})
            a = input('Продолжим? да/нет?\n')
    list.append((i+1, current_dict))

print("Полученная структура:\n[")
for l in list:
    print(l)
print("]")

keys = []
list_dict = []
dict = {}

for i in range(len(list)):
    for key in list[i][1].keys():
        if (key in keys):
            continue
        else:
            keys.append(key)
for key in keys:
    for i in range(len(list)):
        list_dict.append(list[i][1].get(key))
    dict[key] = list_dict.copy()
    list_dict.clear()

print("Искомая аналитика:\n{")
for key,value in dict.items():
    print(f'"{key}":{value}')
print("}")