# Программа принимает действительное положительное число x и целое отрицательное число y.
# Выполните возведение числа x в степень y. Задание реализуйте в виде функции my_func(x, y).
# При решении задания нужно обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами.
# Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.
from my_functions import check_positive_float, check_negative_int
def stepen_1 (x, y):
    return x ** y
def stepen_2 (x, y):
    b = 1 / x
    for i in range (1, y, -1):
        x *= b
    return x

x = input('Введите действительное положительное число:\n')
x = check_positive_float(x)
y = input('Введите целое отрицательное число:\n')
y = check_negative_int(y)

print(f'{x} в степени {y} методом **:\n{stepen_1(x, y)}\n')
print(f'{x} в степени {y} с помощью цикла:\n{stepen_2(x, y)}')
