# Реализовать функцию int_func(), принимающую слова из маленьких латинских букв и возвращающую их же,
# но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.

from my_functions import lat_symb_or_znak, BigFirst

#импорт функций для проверки вводимых символов и преобразования первой буквы в верхний регистр

string = input('\n\033[0mВведите текстовую строку из маленьких латинских символов без пробелов. \n'
                '\033[32mДля того, чтобы прервать выполнение программы введите "!"\n')
string_proverka = lat_symb_or_znak(string)

while True:
    if string_proverka == '!':
        print('\033[31mработа программы закончена по вводу символа "!"')
        break
    elif string_proverka == string:
        print(f'Ваша строка с первой буквой в верхнем регистре: \n\033[31m{BigFirst(string_proverka)}')
        string = input('\n\033[0mВведите текстовую строку из маленьких латинских символов без пробелов. \n'
                       '\033[32mДля того, чтобы прервать выполнение программы введите "!"\n')
        string_proverka = lat_symb_or_znak(string)
    else:
        string = input('\n\033[31mВы ввели что-то не то... Повторим. \n'
                       '\033[32mДля того, чтобвы прервать выполнение программы введите "!"\n')
        string_proverka = lat_symb_or_znak(string)

