# Продолжить работу над заданием. В программу должна попадать строка из слов, разделённых пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре. Нужно сделать вывод исходной строки,
# но каждое слово должно начинаться с заглавной буквы. Используйте написанную ранее функцию int_func().

from my_functions import lat_symb_or_znak, BigFirst

# импорт функций для проверки вводимых символов и преобразования первой буквы в верхний регистр
new_string = ''
s = True

string = input(f'\n\033[0mВведите несколько слов маленькими латинскими символами. \n')
a = string.split()


while s == True:
    for i in range(len(a)):
        word = lat_symb_or_znak(a[i])
        if word == a[i]:
            new_string += f'{BigFirst(word)} '
        else:
            print(f'\033[31m{a[i]} не подходит под заданные условия')
    print(f'\033[32mИтоговая строка:\n\033[0m{new_string}')
    cont = input(f'\n\033[32mЖелаете продолжить? \n'
                 f'\033[31mВведите "да" или "нет"\n')
    if cont == 'да':
        s = True
        string = input(f'\n\033[0mВведите несколько слов маленькими латинскими символами. \n')
        a = string.split()
    else:
        s = False

