#Представлен  список  чисел.  Необходимо  вывести  элементы  исходного  списка,  значения
#которых больше предыдущего элемента.
#Подсказка:  элементы,  удовлетворяющие  условию,  оформить  в  виде  списка.  Для  его
#формирования используйте генератор.
#Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
#Результат: [12, 44, 4, 10, 78, 123]..

from random import randint

list = []

for i in range(10):
       list.append(randint(-100,100))

print(f'\nИсходный список:\n{list}\n')

new_list = [el for el in list[1:10] if el>list[list.index(el)-1]]

print(f'Итоговый список:\n{new_list}')
