# Представлен список чисел. Опредеите элементы списка, не имеющие повторений.
# Сформируйте итоговый массив чисел, соответствующий требованию.
# Элементы выведите в порядке их следования в исходном списке.
# Для выполнения задания обязательно используйте генератор
# Пример исходного списка: [2,2,2,7,23,1,44,44,3,2,10,7,4,11]
# Результат: [23,1,3,10,4,11]
from random import randint
list = []

for i in range(20):

       list.append(randint(-5,5))

print(f'\nИсходный список:\n{list}\n')

new_list = [el for el in list if list.count(el)==1]

print(f'Итоговый список:\n{new_list}')


