# Реализовать формирование списка, используя функцию range() и возможности генератора. В
# список  должны  войти  чётные  числа  от  100  до  1000  (включая  границы).  Нужно  получить
# результат вычисления произведения всех элементов списка.
from functools import reduce

print(f'Произведение всех четных чисел от 100 до 1000\n\n{reduce(lambda a,b: a*b, [el for el in range(100, 1000+1, 2)])}')


