# 2. Пользователь вводит время в секундах. Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс.
# Используйте форматирование строк.

seconds = input('Доброго времени суток! Подскажите, пожалуйста, сколько натикало на Ваших часах в секундах?:\n')

#проверка числа на принадлежность к множеству целых, не меньших 0, чисел
#проверка не превышает ли число секунд количества секунд в земных сутках

while True:
    try:
        seconds = int(seconds)
        if seconds < 0:
            seconds = int(input('Давайте количество секунд будет ЦЕЛЫМ ПОЛОЖИТЕЛЬНЫМ ИЛИ РАВНЫМ НУЛЮ числом, ок?\nПопробуем ещё раз: '))
            continue
        if seconds > 86400:
            seconds = int(input('Или сутки у Вас длиннее земных или в часах сломалась "суточная стрелка"\nНапоминаю, в сутках 86400 секунд\nДавайте попробуем ещё раз:\n'))
            continue
        break
    except ValueError:
        seconds = input('Давайте количество секунд будет ЦЕЛЫМ числом, ок?\nПопробуем ещё раз:\n')

if seconds == 86400:
    print('О! как раз сутки прошли. На часах 00:00:00')
else:
    hh = seconds // 3600
    mm = (seconds - hh * 3600) // 60
    ss = seconds - hh * 3600 - mm * 60
#перевод часов, минут, секунд из вида h:m:s в 0h:0m:0s если они < 10
    if hh < 10:
        hh = str(f'0{hh}')
    if mm < 10:
        mm = str(f'0{mm}')
    if ss < 10:
        ss = str(f'0{ss}')
    print(f'Искомое время в формате чч:мм:сс:\n{hh}:{mm}:{ss}')
