#3. Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn.
# Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.

number = input('Введите Ваше число. Если число будет отрицательным, я возьму его абсолютное значение:\n')

#проверка числа на принадлежность к множеству целых, положительных, если число < 0 берется модуль

while True:
    try:
        number = int(number)
        break
    except ValueError:
        number = input('Давайте это будет числом и число будет целым, ок?\nПопробуем ещё раз:\n')

if number < 0:
    number = - number

#вычисляется сумма в соответствии с условиями задачи

count = int(input('Я выведу значение суммы чисел, получающихся из Вашего путем его N-кратного повторения (n + nn + nnn+.....+n..(Nраз)..n) \nВведите натуральное N:\n'))

i = 1
new_number = 0
summ = 0
while i <= count:
    new_number = number + new_number * 10
    summ += new_number
    i += 1

print(f'Искомая сумма:{summ}')

#вычисляется сумма степеней заданного числа. максимальная степень - число, полученное от пользователя на предыдущем вводе

i = 0
stepen = 1
summastepenei = 0

while i != count:
   stepen = stepen * number
   summastepenei += stepen
   i += 1

print(f'А это: {summastepenei} - число, получающееся суммированием степеней Вашего числа вплоть до степени N:'
      f'n+n^1+n^2+....n^N\n')