#5. Запросите у пользователя значения выручки и издержек фирмы.
#Определите, с каким финансовым результатом работает фирма
#(прибыль — выручка больше издержек, или убыток — издержки больше выручки).
#Выведите соответствующее сообщение. Если фирма отработала с прибылью,
#вычислите рентабельность выручки (соотношение прибыли к выручке).
#Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

#earnings - выручка, loss_costs - убыток, profit - прибыль

#проверка выручки, издержек на положительность, рациональность

earnings = input('Введите величину ВЫРУЧКИ компании: ')

while True:
    try:
        earnings = float(earnings)
        if earnings < 0:
            earnings = input('Давайте вырчука будет ПОЛОЖИТЕЛЬНЫМ числом, ок?\nПопробуем ещё раз:\n')
            continue
        else:
            break
    except ValueError:
        earnings = input('Давайте выручка будет РАЦИОНАЛЬНЫМ ЧИСЛОМ, ок?\nПопробуем ещё раз:\n')

loss_costs = input('Введите величину ИЗДЕРЖЕК компании: ')

while True:
    try:
        loss_costs = float(loss_costs)
        if loss_costs < 0:
            loss_costs = input('Давайте издеоржки будут ПОЛОЖИТЕЛЬНЫМ числом, ок?\nПопробуем ещё раз:\n')
            continue
        else:
            break
    except ValueError:
        loss_costs = input('Давайте издержки будут РАЦИОНАЛЬНЫМ ЧИСЛОМ, ок?\nПопробуем ещё раз:\n')

if earnings > loss_costs:
    profit = earnings - loss_costs
    employes_number = input('Замечательная компания, финансовый результат: прибыль!\n'
          f'Рентабельность выручки составляет {round(profit/earnings*100,2)}%\n'
          'Введите количество сотрудников, работающих в Вашей фирме:\n')
    while True:
        try:
            employes_number = int(employes_number)
            if employes_number <= 0:
                employes_number = input('А "комплексных" сотруников у Вас нет? Давайте количество сотрудников будет НАТУРАЛЬНЫМ числом ок?\nПопробуем ещё раз:\n')
                continue
            else:
                break
        except ValueError:
            employes_number = input('Давайте количество сотрудников будет НАТУРАЛЬНЫМ числом, ок?\nПопробуем ещё раз:\n')
    print('Прибыль фирмы в расчете на одного сотрудника составляет:\n'
          f'{profit/employes_number}')
elif earnings < loss_costs:
    print('Требуется что-то предпринять, финансовый результат: убыток!')
else:
    print('Внимание: выручка равна издержкам, нулевой финансовый результат...')


