#Создать класс Road (дорога)
# - определить атрибуты: length (длина) и width (ширина)
# - значения атрибутов должны передаваться при создании экземпляра класса
# - атрибуты сделать защищенными
# - определить метод рассчета асфальта, необходимого для покрытия всей дороги
# - использовать формулу: длина*ширина*масса асфальта для покрытия одного кв. метра дороги асфальтом, толщиной в
# 1 см*число см толщины полотна;
# - проверить работу примера
# - например 20м*5000м*25кг*5см=12500т

class Road:
    def __init__(self, length, width):
        self.__length = length
        self.__width = width
        self.pr = self.__width*self.__length
    def asphalt_mass(self):
        return self.pr*25*5/1000

mass = Road(int(input('Введите длину дороги в метрах ')),int(input('Введите ширину дороги в метрах')))


print(f'Требуемая масса асфальта: {mass.asphalt_mass()} т')
