"""Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод
__init__()), который должен принимать данные (список списков) для формирования матрицы.
Подсказка: матрица — система некоторых математических величин, расположенных в виде
прямоугольной схемы.
Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в
привычном виде.
Далее реализовать перегрузку метода __add__() для реализации операции сложения двух
объектов класса Matrix (двух матриц). Результатом сложения должна быть новая матрица.
Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой
строки первой матрицы складываем с первым элементом первой строки второй матрицы и т.д.

"""
class Matrix:

    def __init__(self, ls1):
        self.ls1 = ls1

    def __str__(self):
        string = ''
        for j in self.ls1:
            for i in j:
                string += f'\t{i}'
            string += '\n'
        return string

    def __add__(self, other):
        string_new = ''
        rows = len(self.ls1)
        cols = len(self.ls1[0])
        for i in range(rows):
            for j in range(cols):
                string_new += f'\t{self.ls1[i][j]+other.ls1[i][j]}'
            string_new += '\n'
        return string_new

mtx1 = Matrix([[1,3,5], [1,2,3], [1,3,4]])
mtx2 = Matrix([[0,3,1], [1,0,3], [2,3,1]])
print(f'    матрциа 1: \n{mtx1}')
print(f'    матрциа 2: \n{mtx2}')
print(f'  сумма матриц: \n{mtx1+mtx2}')