"""Реализовать программу работы с органическими клетками, состоящими из ячеек. Необходимо
создать класс Клетка. В его конструкторе инициализировать параметр, соответствующий
количеству ячеек клетки (целое число). В классе должны быть реализованы методы
перегрузки арифметических операторов: сложение (__add__()), вычитание (__sub__()),
умножение (__mul__()), деление (__truediv__()). Данные методы должны применяться только
к клеткам и выполнять увеличение, уменьшение, умножение и целочисленное (с округлением
до целого) деление клеток, соответственно.
Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться
сумме ячеек исходных двух клеток.
Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность
количества ячеек двух клеток больше нуля, иначе выводить соответствующее сообщение.
Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как
произведение количества ячеек этих двух клеток.
Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как
целочисленное деление количества ячеек этих двух клеток.
В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и
количество ячеек в ряду. Данный метод позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n
равно переданному аргументу. Если ячеек на формирование ряда не хватает, то в последний
ряд записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод
make_order() вернет строку: *****\n*****\n**.
Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5. Тогда метод
make_order() вернет строку: *****\n*****\n*****.
Подсказка: подробный список операторов для перегрузки доступен по ссылке."""

class Cell:
    def __init__(self, cellule_number):
        self.cellule_number = cellule_number;

    def __add__(self, other): #сложение
        return self.cellule_number + other.cellule_number

    def __sub__(self, other): #вычитание
        if self.cellule_number > other.cellule_number:
            return self.cellule_number - other.cellule_number
        else:
            return f'Не может быть клетки с неположительным количеством ячеек'

    def __mul__(self, other): #умножение
        return self.cellule_number * other.cellule_number

    def __truediv__(self, other): #деление
        if self.cellule_number / other.cellule_number > 0:
            return self.cellule_number // other.cellule_number
        else:
            return f'Первая клетка слишком мала'
    def make_order(self, number_in_row):
        string = ''
        for i in range(self.cellule_number//number_in_row):
            string += '*'*number_in_row+'\\n'
        string += '*'*(self.cellule_number%number_in_row)
        return string



first_cell = Cell(25)
second_cell = Cell(10)
print(f'Количество ячеек в первой клетке: {first_cell.cellule_number}')
print(f'Количество ячеек во второй клетке: {second_cell.cellule_number}')
print('*****************************************************************')
print(f'Объединение двух клеток: {first_cell + second_cell}')
print(f'Вычитание двух клеток: {first_cell - second_cell}')
print(f'Умножение двух клеток: {first_cell * second_cell}')
print(f'Деление двух клеток: {first_cell / second_cell}')
print('*****************************************************************')
print(f'Организация ячеек по рядам: {first_cell.make_order(7)}')