#Сформировать (не прорграммно) текстовый файл. В нем каждая строка должна описывать учебный предмет и наличие
#лекционных, практичеких и лабораторных занятий по предмету. Сюда должно входить и количество занятий. Необязательно,
#чтобы для каждого предмета были все типы занятий. Сформировать словарь, содержащий название предмета и общее количество
#занятий по нему. Вывести его на экран
#Примеры строк файла: Информатика: 100(л) 50(пр) 20(лаб).
#                     Физика: 30(л) - 10(лаб)
#                     Физкультура: - 30(пр) -
#Пример словаря: {'Информатика':170, 'Физика':40, 'Физкультура':30}

dictitog={}

with open('hw6.txt', 'r', encoding='utf-8') as f:
    for string in f:
        summ = 0
        key = ''
        string_split = string.replace("("," ").replace(")"," ").replace(":"," ").split(' ')
        key = string_split[0]
        for el in string_split:
            if el.isdigit():
                 summ+=int(el)
        dict = {key:summ}
        dictitog.update(dict)
print(dictitog)
