"""Создайте собственный класс-исключение, который должен проверять содержимое списка на
наличие только чисел. Проверить работу исключения на реальном примере. Запрашивать у
пользователя  данные  и  заполнять  список  необходимо  только  числами.  Класс-исключение
должен контролировать типы данных элементов списка.
Примечание:  длина  списка  не  фиксирована.  Элементы  запрашиваются  бесконечно,  пока
пользователь сам не остановит работу скрипта, введя, например, команду «stop». При этом
скрипт завершается, сформированный список с числами выводится на экран.
Подсказка: для этого задания примем, что пользователь может вводить только числа и строки.
Во время ввода пользователем очередного элемента необходимо реализовать проверку типа
элемента.  Вносить  его  в  список,  только  если  введено число. Класс-исключение должен не
позволить пользователю ввести текст (не число) и отобразить соответствующее сообщение.
При этом работа скрипта не должна завершаться.

"""


class MyException:
    def __init__(self, string):
        self.string = string

    @staticmethod
    def number_validation(string):
        a = False
        while a == False and string != 'stop':
            try:
                string = float(string)
                a = True
            except:
                string = input("Вы ввели не число, повторите ввод:")
        return string


final_list = []
new_el = ''
while new_el != 'stop':
    final_list.append(new_el)
    new_el = MyException.number_validation(input('Введите число\nДля прекращения работы программы введите "stop"\n'))
final_list.pop(0)
print(final_list)




